# GetUIDataItems Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryPressureDropUIData..::..GetUIDataItems Method
PipeFittingAndAccessoryPressureDropUIData Class See Also
---
Gets all UI data items stored in the UI data.
**Namespace:** Autodesk.Revit.UI.Plumbing**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<PipeFittingAndAccessoryPressureDropUIDataItem> GetUIDataItems()
```

Visual Basic
---
```text
Public Function GetUIDataItems As IList(Of PipeFittingAndAccessoryPressureDropUIDataItem)
```

Visual C++
---
```text
public:
IList<PipeFittingAndAccessoryPressureDropUIDataItem^>^ GetUIDataItems()
```

# ### Return Value
An array of UI data items.
# See Also
PipeFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Plumbing Namespace